In [1]:
import pandas as pd

In [2]:
estudiantes = pd.read_csv("estudiantes.csv")
print(estudiantes)

       NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
0      Victor    23      M          Diseño Grafico  Segundo
1      Josefa    15      F  Desarrollo de software  Primero
2        Raul    30      M          Diseño Grafico  Tercero
3     Nayrobi    20      F              Enfermeria  Primero
4   Anastasia    40      F             Gastronomia  Segundo
5     Rolando    40      M           Audiovisuales  Segundo
6      Carlos    15      M           Audiovisuales  Segundo
7       Pedro    13      M  Desarrollo de software  Primero
8       Julio    25      M             Gastronomia  Segundo
9    Isabella    68      F              Enfermeria  Primero
10     Susana    77      F              Enfermeria  Primero
11   Fernando    33      M  Desarrollo de software  Primero

In [3]:
estudiantes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   NOMBRE    12 non-null     object
 1   EDAD      12 non-null     int64
 2   GENERO    12 non-null     object
 3   CARRERA   12 non-null     object
 4   SEMESTRE  12 non-null     object
dtypes: int64(1), object(4)
memory usage: 612.0+ bytes

In [5]:
estudiantes.head(9)

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
0     Victor    23      M          Diseño Grafico  Segundo
1     Josefa    15      F  Desarrollo de software  Primero
2       Raul    30      M          Diseño Grafico  Tercero
3    Nayrobi    20      F              Enfermeria  Primero
4  Anastasia    40      F             Gastronomia  Segundo
5    Rolando    40      M           Audiovisuales  Segundo
6     Carlos    15      M           Audiovisuales  Segundo
7      Pedro    13      M  Desarrollo de software  Primero
8      Julio    25      M             Gastronomia  Segundo

In [6]:
estudiantes.tail()

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
7      Pedro    13      M  Desarrollo de software  Primero
8      Julio    25      M             Gastronomia  Segundo
9   Isabella    68      F              Enfermeria  Primero
10    Susana    77      F              Enfermeria  Primero
11  Fernando    33      M  Desarrollo de software  Primero

In [ ]:
#Filtrar datos segun el nombre: loc([indiceFila, nombreColumna])

estudiantes.loc[3:5, ['NOMBRE', 'EDAD', 'GENERO']]

      NOMBRE  EDAD GENERO
3    Nayrobi    20      F
4  Anastasia    40      F
5    Rolando    40      M

In [ ]:
#Filtrar datos segun posicion: iloc([indiceFila, indicecolumna])

estudiantes.iloc[3:6, 0:3]

      NOMBRE  EDAD GENERO
3    Nayrobi    20      F
4  Anastasia    40      F
5    Rolando    40      M

In [28]:
#Filtrar solo la informacion de Anastasia, forma 1

estudiantes.iloc[4, 0:4]

NOMBRE       Anastasia
EDAD                40
GENERO               F
CARRERA    Gastronomia
Name: 4, dtype: object

In [29]:
#Filtrar solo la informacion de Anastasia, forma 2


estudiantes[estudiantes["NOMBRE"] == "Anastasia"]

      NOMBRE  EDAD GENERO      CARRERA SEMESTRE
4  Anastasia    40      F  Gastronomia  Segundo

In [30]:
#Filtrar hombres mayores de 30

estudiantes[(estudiantes["GENERO"] == "M") & (estudiantes["EDAD"] > 30)]

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
5    Rolando    40      M           Audiovisuales  Segundo
11  Fernando    33      M  Desarrollo de software  Primero

In [37]:
#Edad promedio
print("La edad promedio es: ", estudiantes["EDAD"].mean())

#Edad maxima
print("La edad maxima es: ", estudiantes["EDAD"].max())

#Edad minima
print("La edad minima es: ", estudiantes["EDAD"].min())

#Desviacion standar edad
print("Desviacion standar de la edad es: ", estudiantes["EDAD"].std())

La edad promedio es:  33.25
La edad maxima es:  77
La edad minima es:  13
Desviacion standar de la edad es:  20.556463261421744

In [39]:
estudiantes = {"Nombre": ["Laura", "Fernando", "Pedro"],
               "Ocupacion": ["Docente", "Futbolista", "Entrenador"]}

df = pd.DataFrame(estudiantes)
df

     Nombre   Ocupacion
0     Laura     Docente
1  Fernando  Futbolista
2     Pedro  Entrenador